Repository: athidh/charmer
Catalog: frontend/lib/l10n/app_*.arb
Languages: ml, ta

# login_title
source: Welcome back!
ml: തിരികെ സ്വാഗതം!
ta: மீண்டும் வரவேற்கிறோம்!

# signup_title
source: Create Account
ml: അക്കൗണ്ട് സൃഷ്ടിക്കുക
ta: கணக்கை உருவாக்கு

# email_label
source: Email Address
ml: ഇമെയിൽ വിലാസം
ta: மின்னஞ்சல் முகவரி

# password_label
source: Password
ml: പാസ്‌വേർഡ്
ta: கடவுச்சொல்

# username_label
source: Username
ml: ഉപയോക്തൃനാമം
ta: பயனர் பெயர்

source: Forgot Password?
ml: പാസ്‌വേർഡ് മറന്നോ?
ta: கடவுச்சொல் மறந்துவிட்டதா?

source: Welcome back!
ml: തിരികെ സ്വാഗതം!
ta: மீண்டும் வரவேற்கிறோம்!

# sign_in_subtitle
source: Sign in to access your advisor
ml: നിങ്ങളുടെ ഉപദേഷ്ടാവിനെ ആക്സസ് ചെയ്യാൻ സൈൻ ഇൻ ചെയ്യുക
ta: உங்கள் ஆலோசகரை அணுக உள்நுழையவும்

# create_account_btn
source: Create Account
ml: അക്കൗണ്ട് സൃഷ്ടിക്കുക
ta: கணக்கை உருவாக்கு

# login_btn
source: Login
ml: ലോഗിൻ
ta: உள்நுழை

source: or continue with
ml: അല്ലെങ്കിൽ ഇതുപയോഗിച്ച് തുടരുക
ta: அல்லது இதனுடன் தொடரவும்

# no_account
source: Don't have an account?
ml: അക്കൗണ്ട് ഇല്ലേ?
ta: கணக்கு இல்லையா?

# have_account
source: Already have an account?
ml: ഇതിനകം അക്കൗണ്ട് ഉണ്ടോ?
ta: ஏற்கனவே கணக்கு உள்ளதா?

source: Sign Up
ml: സൈൻ അപ്പ്
ta: பதிவு செய்

source: Language
ml: ഭാഷ
ta: மொழி

# tab_signup
source: Sign Up
ml: സൈൻ അപ്പ്
ta: பதிவு செய்

# tab_login
source: Login
ml: ലോഗിൻ
ta: உள்நுழை

source: Dark Mode
ml: ഇരുണ്ട മോഡ്
ta: இருண்ட பயன்முறை

# app_name
source: CHARMER
ml: ചാർമർ
ta: சார்மர்

# app_tagline
source: Your Voice. Your Land. Your Advisor.
ml: നിങ്ങളുടെ ശബ്ദം. നിങ്ങളുടെ ഭൂമി. നിങ്ങളുടെ ഉപദേശി.
ta: உங்க குரல். உங்க நிலம். உங்க ஆலோசகர்.

source: Press to Speak
ml: സംസാരിക്കാൻ അമർത്തുക
ta: பேச அழுத்துங்க

source: Listening...
ml: കേൾക്കുന്നു...
ta: கேக்குது...

source: Processing...
ml: പ്രോസസ്സ് ചെയ്യുന്നു...
ta: செயலாக்கம்...

source: Speaking...
ml: സംസാരിക്കുന്നു...
ta: பேசுது...

# voice_hint
source: Ask me about soil health, fertilizer, weather, or upload a PDF report
ml: മണ്ണിന്റെ ആരോഗ്യം, വളം, കാലാവസ്ഥ എന്നിവയെക്കുറിച്ച് ചോദിക്കൂ, അല്ലെങ്കിൽ PDF അപ്‌ലോഡ് ചെയ്യൂ
ta: மண் ஆரோக்கியம், உரம், வானிலை பத்தி கேளுங்க, அல்லது PDF ஐ பதிவேற்றுங்க

source: Upload PDF
ml: PDF അപ്‌ലോഡ് ചെയ്യുക
ta: PDF பதிவேற்று

# pdf_analyzing
source: Analyzing document...
ml: രേഖ വിശകലനം ചെയ്യുന്നു...
ta: ஆவணத்தை ஆராய்கிறது...

# pdf_analyzed
source: Document analyzed successfully
ml: രേഖ വിജയകരമായി വിശകലനം ചെയ്തു
ta: ஆவணம் வெற்றிகரமாக ஆராய்ச்சி செய்யப்பட்டது

source: Soil Health
ml: മണ്ണിന്റെ ആരോഗ്യം
ta: மண் ஆரோக்கியம்

source: Fertilizer Ratio
ml: വളം അനുപാതം
ta: உர விகிதம்

source: Weather Forecast
ml: കാലാവസ്ഥാ പ്രവചനം
ta: வானிலை முன்னறிவிப்பு

source: Crop Advisory
ml: വിള ഉപദേശം
ta: பயிர் ஆலோசனை

# hidden_risks
source: Hidden Risks Detected
ml: മറഞ്ഞിരിക്കുന്ന അപകടങ്ങൾ കണ്ടെത്തി
ta: மறைவான ஆபத்துகள் கண்டறியப்பட்டன

source: Rainfall Deviation
ml: മഴ വ്യതിയാനം
ta: மழை அளவு மாற்றம்

source: Nutrient Drift
ml: പോഷക ചലനം
ta: ஊட்டச்சத்து நகர்வு

# risk_low
source: Low Risk
ml: കുറഞ്ഞ അപകടം
ta: குறைவான ஆபத்து

# risk_medium
source: Medium Risk
ml: മിതമായ അപകടം
ta: நடுத்தர ஆபத்து

# risk_high
source: High Risk
ml: ഉയർന്ന അപകടം
ta: அதிக ஆபத்து

# why_this
source: Why this recommendation?
ml: എന്തുകൊണ്ട് ഈ ശുപാർശ?
ta: ஏன் இந்த பரிந்துரை?

# source_citation
source: Source
ml: ഉറവിടം
ta: ஆதாரம்

# acreage
source: Acreage (acres)
ml: വിസ്തീർണ്ണം (ഏക്കർ)
ta: பரப்பளவு (ஏக்கர்)

source: Crop Type
ml: വിള തരം
ta: பயிர் வகை

# calculate_ratio
source: Calculate Fertilizer Ratio
ml: വളം അനുപാതം കണക്കാക്കുക
ta: உர விகிதத்தை கணக்கிடு

# nitrogen
source: Nitrogen (N)
ml: നൈട്രജൻ (N)
ta: நைட்ரஜன் (N)

# phosphate
source: Phosphate (P)
ml: ഫോസ്ഫേറ്റ് (P)
ta: பாஸ்பேட் (P)

# potassium
source: Potassium (K)
ml: പൊട്ടാസ്യം (K)
ta: பொட்டாசியம் (K)

# kg_per_acre
source: kg/acre
ml: കിലോ/ഏക്കർ
ta: கிலோ/ஏக்கர்

source: District
ml: ജില്ല
ta: மாவட்டம்

source: Coimbatore
ml: കോയമ്പത്തൂർ
ta: கோயம்புத்தூர்

source: Kerala
ml: കേരളം
ta: கேரளா

# micro_climate
source: Micro-Climate Data
ml: സൂക്ഷ്മ-കാലാവസ്ഥ ഡാറ്റ
ta: நுண்-காலநிலை தரவு

# rainfall_10yr
source: 10-Year Rainfall
ml: 10-വർഷ മഴ
ta: 10-ஆண்டு மழை

source: Soil Type
ml: മണ്ണ് തരം
ta: மண் வகை

# debug_panel
source: Technical Metrics
ml: ടെക്നിക്കൽ മെട്രിക്സ്
ta: தொழில்நுட்ப அளவீடுகள்

source: Inference Latency
ml: ഇൻഫറൻസ് ലേറ്റൻസി
ta: அனுமான தாமதம்

# info_density
source: Information Density
ml: ഇൻഫർമേഷൻ ഡെൻസിറ്റി
ta: தகவல் அடர்த்தி

source: Phonetic Accuracy
ml: ഫൊണറ്റിക് അക്യുറസി
ta: ஒலிப்பு துல்லியம்

source: Pipeline Stage
ml: പൈപ്പ്‌ലൈൻ സ്റ്റേജ്
ta: செயலாக்க நிலை

source: Good Morning
ml: സുപ്രഭാതം
ta: காலை வணக்கம்

source: Good Afternoon
ml: ഉച്ചയ്ക്ക് ശേഷം നമസ്കാരം
ta: மதிய வணக்கம்

source: Good Evening
ml: ശുഭ സന്ധ്യ
ta: மாலை வணக்கம்

# hi_user
source: Hi, {name} ðŸ‘‹
ml: ഹായ്, {name} 👋
ta: வணக்கம், {name} 👋

source: Recent Conversations
ml: സമീപത്തെ സംഭാഷണങ്ങൾ
ta: சமீபத்திய உரையாடல்கள்

# no_conversations
source: No conversations yet. Press the mic to begin!
ml: ഇതുവരെ സംഭാഷണങ്ങൾ ഇല്ല. മൈക്ക് അമർത്തൂ!
ta: இன்னும் உரையாடல்கள் இல்ல. மைக்கை அழுத்துங்க!

source: Conversation History
ml: സംഭാഷണ ചരിത്രം
ta: உரையாடல் வரலாறு
